cypress/fixtures/convenios/procesarPagoConvenios.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sn="http://www.bncr.fi.cr/soa/SN_ProcesaPagoConvenios" xmlns:esq="http://www.bncr.fi.cr/soa/EsquemasComunes">
   <soapenv:Header/>
   <soapenv:Body>
      <sn:solicitud>
         <!--Optional:-->
         <sn:encabezado>
            <esq:fechaHoraConsumo>2020-01-26T19:15:54.294Z</esq:fechaHoraConsumo>
            <esq:canalConsumidor>IBP</esq:canalConsumidor>
            <esq:usuarioConsumidor>113720104</esq:usuarioConsumidor>
            <esq:direccionIPConsumo>?</esq:direccionIPConsumo>
            <esq:nombreServicio>?</esq:nombreServicio>
         </sn:encabezado>
         <!--Optional:-->
         <sn:cuerpo>
            <!--Optional:-->
            <sn:entradaServicio>
               <!--Optional:-->
               <sn:transaccion>PAGO_SERVICIOS</sn:transaccion>
               <!--Optional:-->
               <sn:subTransaccion>1</sn:subTransaccion>
               <!--Optional:-->
               <sn:sistemaConvenios>ConvenioPagoServios</sn:sistemaConvenios>
               <!--Optional:-->
               <sn:formaPago>1</sn:formaPago>
               <!--Optional:-->
               <sn:tipoConectividad>2</sn:tipoConectividad>
               <!--Optional:-->
               <sn:codigoConvenio>1</sn:codigoConvenio>
               <!--Optional:-->
               <sn:tipoLlave>99</sn:tipoLlave>
               <!--Optional:-->
               <sn:empresa>156</sn:empresa>
               <!--Optional:-->
               <sn:numeroServicio>113720104</sn:numeroServicio>
               <!--Optional:-->
               <sn:codigoInstitucion>156</sn:codigoInstitucion>
               <!--Optional:-->
               <sn:usuarioTC>IBANK</sn:usuarioTC>
               <!--Optional:-->
               <sn:codigoBanco>151</sn:codigoBanco>
               <!--Optional:-->
               <sn:codigoAgencia>228</sn:codigoAgencia>
               <!--Optional:-->
               <sn:tipoCanal>6</sn:tipoCanal>
               <!--Optional:-->
               <sn:tipoTransaccionPago>1</sn:tipoTransaccionPago>
               <!--Optional:-->
               <sn:valorServicio>113720104</sn:valorServicio>
               <!--Optional:-->
               <sn:periodoRecibo>20220420</sn:periodoRecibo>
               <!--Optional:-->
               <sn:montoRecibo>2000.00</sn:montoRecibo>
               <!--Optional:-->
               <sn:fechaVencimiento>?</sn:fechaVencimiento>
               <!--Optional:-->
               <sn:numeroFactura>00000000000002895006</sn:numeroFactura>
               <!--Optional:-->
               <sn:selfDeVerificacion>0</sn:selfDeVerificacion>
               <!--Optional:-->
               <sn:numeroCuotas>0</sn:numeroCuotas>
               <!--Optional:-->
               <sn:monedaServicio>01</sn:monedaServicio>
               <!--Optional:-->
               <sn:nombreEmpresa>ICER - MEP</sn:nombreEmpresa>
               <!--Optional:-->
               <sn:nombreConvenio>PRUEBAS ICER</sn:nombreConvenio>
               <!--Optional:-->
               <sn:nombreValorServicio>IDENTIFICACION</sn:nombreValorServicio>
               <!--Optional:-->
               <sn:nombreDuenoRecibo>CARLOS LUIS RUIZ CAMPOS</sn:nombreDuenoRecibo>
               <!--Optional:-->
               <sn:numeroTransaccion>0</sn:numeroTransaccion>
               <!--Optional:-->
               <sn:numeroValoresPago>1</sn:numeroValoresPago>
               <!--Optional:-->
               <sn:tipoValorPago>6</sn:tipoValorPago>
               <!--Optional:-->
               <sn:codigoBancoEmisor>0</sn:codigoBancoEmisor>
               <!--Optional:-->
               <sn:numeroChequeDelValor>?</sn:numeroChequeDelValor>
               <!--Optional:-->
               <sn:numeroCuentaCorrienteValor>?</sn:numeroCuentaCorrienteValor>
               <!--Optional:-->
               <sn:oficina>228</sn:oficina>
               <!--Optional:-->
               <sn:montoMovimiento>2000.00</sn:montoMovimiento>
               <!--Optional:-->
               <sn:monedaTransaccion>01</sn:monedaTransaccion>
               <!--Optional:-->
               <sn:tipoIdentificacion>1</sn:tipoIdentificacion>
               <!--Optional:-->
               <sn:numeroIdentificacion>1-1372-0104</sn:numeroIdentificacion>
               <!--Optional:-->
               <sn:numeroCliente>428402</sn:numeroCliente>
               <!--Optional:-->
               <sn:cuentaClienteOrigen>?</sn:cuentaClienteOrigen>
               <!--Optional:-->
               <sn:productoOrigen>100</sn:productoOrigen>
               <!--Optional:-->
               <sn:monedaOrigen>01</sn:monedaOrigen>
               <!--Optional:-->
               <sn:oficinaOrigen>080</sn:oficinaOrigen>
               <!--Optional:-->
               <sn:numeroCuentaOrigen>100015</sn:numeroCuentaOrigen>
               <!--Optional:-->
               <sn:digitoVerificadorOrigen>3</sn:digitoVerificadorOrigen>
               <!--Optional:-->
               <sn:detalleMovimiento>Pago I.C.E.R 113720104</sn:detalleMovimiento>
               <!--Optional:-->
               <sn:nombreDepositante>RUIZ CAMPOS CARLOS LUIS</sn:nombreDepositante>
               <!--Optional:-->
               <sn:motivoCompraVenta>00</sn:motivoCompraVenta>
               <!--Optional:-->
               <sn:tarjeta>?</sn:tarjeta>
               <!--Optional:-->
               <sn:fechaVence>?</sn:fechaVence>
               <!--Optional:-->
               <sn:codigoEstablecimiento>?</sn:codigoEstablecimiento>
               <!--Optional:-->
               <sn:origenProceso>?</sn:origenProceso>
               <sn:cuentaIBANOrigen>CR34 0151 0801 0011 0001 56</sn:cuentaIBANOrigen>
               <sn:esFavorito>true</sn:esFavorito>
               <sn:formatoCompobanteCuentaDebitada>B</sn:formatoCompobanteCuentaDebitada>
            </sn:entradaServicio>
         </sn:cuerpo>
      </sn:solicitud>
   </soapenv:Body>
</soapenv:Envelope>